Repository: CaptKraken/ems-app
Catalog: lib/l10n/app_*.arb
Languages: km

# language
source: English
km: ភាសារខ្មែរ

# hello
source: Hello, {name}
km: សួស្ដី {name}

# timeText
source: It's {time} on {date}.
km: ពេលនេះម៉ោង {time} ថ្ងៃទី {date}.

source: Check In
km: ស្កេនចូល

source: Check Out
km: ស្កេនចេញ

source: Morning
km: ពេលព្រឹក

source: Afternoon
km: ពេលថ្ងៃ

source: Loading
km: កំពុងដើរ

source: Check In/Out
km: ស្កេនចេញ/ចូល

source: Attendance
km: វត្តមាន

source: Attendance Manager
km: គ្រប់គ្រងវត្តមាន

source: My Attendance
km: វត្តមានរបស់ខ្ញុំ

source: Overtime
km: ការថែមម៉ោង

source: My Overtime
km: ការថែមម៉ោងរបស់ខ្ញុំ

source: My Profile
km: ប្រវត្តិរូបរបស់ខ្ញុំ

source: Edit Profile
km: កែប្រែប្រវត្តិរូប

source: Change Password
km: ដូរលេខសំងាត់

source: Logout
km: ចាកចេញ

source: Flash
km: ភ្លើង

# scanInstruction
source: Keep the QR code in the center
km: ដាក់ QR កូដអោយចំកណ្ដាល

# allowCamera
source: Please allow camera permission to scan QR code.
km: សូមអោយសិទ្ធិកាមេរ៉ាទៅកាន់កម្មវិធីទើបអាចស្កេន QR កូដ។

source: Saving attendance
km: កំពុងរក្សាទុកកំណត់ត្រា

# scanToType
source: Scan the code to {type}
km: {type}ដោយប្រើកូដនេះ

# checkMyself
source: {type} myself
km: {type}ដោយខ្លួនឯង

source: successfully
km: បានជោគជ័យ

source: failed
km: បរាជ័យ

source: Basic Info
km: ព័ត៌មានផ្ទាល់ខ្លួន

source: Name
km: ឈ្មោះ

# phoneNumber
source: Phone
km: លេខទូរស័ព្ទ

source: Email
km: អុីម៉ែល

source: Address
km: អាសយដ្ឋាន

source: Account Type
km: ប្រភេទគណនី

source: Employee Info
km: ព័ត៌មានការងារ

source: Position
km: តំណែង

source: Skill
km: ជំនាញ

source: Salary
km: ប្រាក់ខែ

# rate
source: Skill
km: វាយតំលៃ

source: Background
km: ប្រវត្តិការងារ

source: Not Available
km: មិនមាន

source: Changing
km: កំពុងដូររូប

source: Camera
km: កាមេរ៉ា

source: Gallery
km: វិចិត្រសាល

source: National ID
km: អត្ថសញ្ញាណបណ្ណ

source: Employee
km: បុគ្គលិក

source: design
km: ការរចនា

# errorId
source: Error fetching the ID image.
km: មានបញ្ហាពេលទាញយករូបអត្ថសញ្ញាណបណ្ណ

source: No ID
km: មិនមានអត្ថសញ្ញាណបណ្ណ

source: Confirmation
km: បញ្ជាក់លេខសំងាត់

# pleaseEnterPassword
source: Please enter your password to save the changes.
km: សូមបញ្ជាក់លេខសំងាត់ដើម្បីរក្សាទុកព័ត៌មាន:

source: Confirm
km: បញ្ជាក់

# errorInputPassword
source: Please input password.
km: សូមបញ្ចូលលេខសំងាត់

# errorWrongPassword
source: Wrong password
km: លេខសំងាត់ដែលបញ្ចូលខុស

source: Cancel
km: បោះបង់

# cropImage
source: Crop the image
km: កាត់រូប

source: Old password
km: លេខសំងាត់ចាស់

source: New password
km: លេខសំងាត់ថ្មី

source: Confirm new password
km: បញ្ជាក់លេខសំងាត់ថ្មី

# changingPassword
source: Changing your password...
km: កំពុងដូរលេខសំងាត់...

# errorAllRequired
source: All text inputs are required.
km: សូមបំពេញគ្រប់ប្រអប់ទាំងអស់

# errorPasswordMustMatch
source: Passwords must match.
km: លេខសំងាត់ទាំងពីរត្រូវតែដូចគ្នា

# errorVerificationFailed
source: Password verification failed.
km: ការបញ្ជាក់លេខសំងាត់បានបរាជ័យ

source: Overtime Manager
km: គ្រប់គ្រងថែមម៉ោង

source: Error parsing time
km: មានបញ្ហាបំលែងពេលវេលា

source: View Overtime
km: មើលការថែមម៉ោង

# enterAllInfo
source: Please enter all information below.
km: សូមពិនិត្យមើលទិន្នន័យអោយមានគ្រប់មុននិងចុចរក្សាទុក

source: Date
km: ថ្ងៃ

source: From
km: ពី

source: To
km: ដល់

source: Total
km: ពេលសរុប

source: Note
km: កំណត់ចំណាំ

# error
source: An error has occurred.
km: មានបញ្ហាបង្ហាញកំណត់ត្រាថែមម៉ោង។

source: Update
km: រក្សាទុក

# deleteOvertime
source: Deleting Overtime
km: លុបកំណត់ត្រាថែមម៉ោង

# errorDeletingOvertime
source: Error deleting record.
km: បានជួបបញ្ហាពេលកំពុងលុបកំណត់ត្រា។ ការលុបមិនបានជោគជ័យ។

source: Go
km: បង្ហាញ

# loadingOvertime
source: Fetching overtime records...
km: កំពុងទាញយកទិន្នន័យការថែមម៉ោង...

source: Filter
km: កំណត់ការស្វែងរក

source: Date range
km: រយះពេល

# optionDay
source: Day
km: មួយថ្ងៃ

# optionMultiDay
source: Multiple Days
km: ច្រើនថ្ងៃ

# optionAllTime
source: All Time
km: ទាំងអស់

source: Showing
km: បង្ហាញ

source: all records
km: ទិន្នន័យទាំងអស់

# tapToShowHide
source: Tap on date to show/hide the record.
km: ចុចលើថ្ងៃខែដើម្បីបង្ហាញ/លាក់ទិន្នន័យ

# optionView
source: View
km: មើល

# optionEdit
source: Edit
km: កែប្រែ

# optionDelete
source: Delete
km: លុប

source: Employee Overtime
km: ថែមម៉ោងរបស់បុគ្គលិក

# errorNoRecord
source: No Record Found.
km: មិនមានទិន្នន័យ

# fetchData
source: Fetching Data
km: កំពុងទាញទិន្ន័យ

source: ID
km: អត្ថលេខ

source: Search
km: ស្វែងរក

# fromAtoZ
source: From A-Z
km: ក - អ

# fromZtoA
source: From Z-A
km: អ - ក

source: by ID
km: តាមអត្ថលេខ

source: Info
km: ព័ត៌មាន

source: Edit
km: កែប្រែ

source: Delete
km: លុប

source: No Profile
km: គ្មានរូប

# uploadImage
source: Upload an image
km: បញ្ចូលរូបភាព

source: Status
km: ស្ថានភាព

source: Role
km: តួនាទី

source: Password
km: ពាក្យសម្ងាត់

source: Admin
km: អ្នកគ្រប់គ្រង

source: Active
km: សកម្ម

source: Inactive
km: អសកម្ម

source: Resigned
km: លាឈប់ពីការងារ

source: Fired
km: បញ្ឈប់ពីការងារ

source: Very Good
km: ល្អណាស់

source: Good
km: ល្អ

source: Medium
km: មធ្យម

source: Low
km: ទាប់

# errorName
source: Please Enter Correct Name
km: សូមបញ្ចូលឈ្មោះឲ្យបានត្រឹមត្រូវ

# errorPhone
source: Please Enter Correct Phone
km: សូមបញ្ចូលលេខទូរស័ព្ទឲ្យបានត្រឹមត្រូវ

# errorEmail
source: Please Enter Correct Email
km: សូមបញ្ចូលអុីម៉ែលឲ្យបានត្រឹមត្រូវ

# errorPassword
source: Please Enter Correct Password
km: សូមបញ្ចូលពាក្យសម្ងាត់ឲ្យបានត្រឹមត្រូវ

# errorPasswordLength
source: Enter more than 8 characters
km: ពាក្យសម្ងាត់ត្រូវមានយ៉ាងតិច ៨ អក្សរ

source: Enter Name
km: បញ្ចូលឈ្មោះ

source: Enter Phone
km: បញ្ចូលលេខទូរស័ព្ទ

source: Enter Email
km: បញ្ចូលអុីម៉ែល

source: Enter Password
km: បញ្ចូលពាក្យសម្ងាត់

source: Enter Position
km: បញ្ចូលតំណែង

source: Enter Skill
km: បញ្ចូលជំនាញ

source: Enter Salary
km: បញ្ចូលប្រាក់ខែ

source: Enter Address
km: បញ្ចូលអាសយដ្ឋាន

# enterBackground
source: Enter Employee Work Background
km: បញ្ចូលប្រវត្តិការងាររបស់បុគ្គលិក

source: Are you sure?
km: តើអ្នកប្រាកដឬទេ?

# yourDataWillLost
source: Your data will be lost.
km: ទិន្នន័យរបស់អ្នកនឹងត្រូវបាត់បង់

source: Yes
km: បាទ/ចាស

source: No
km: ទេ

source: No ID Image
km: គ្មានរូបអត្តសញ្ញាណបណ្ណ

source: Save
km: រក្សាទុក

# takePicture
source: Take a picture
km: ថតរូបភាព

source: From gallery
km: ក្នុង Gallery

# doYouWantToAdd
source: Do you want to add new employee?
km: តើអ្នកចង់បន្ថែមបុគ្គលិកថ្មីមែនឬទេ?

source: Employee not found!!
km: មិនមានបុគ្គលិក

source: By Day
km: ប្រចាំថ្ងៃ

source: By Month
km: ប្រចាំខែ

source: By All-Time
km: សរុប

# cannotUndone
source: This action cannot be undone!
km: សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ

# pickDate
source: Pick a Date
km: ជ្រើសរើសកាលបរិច្ឆេទ

source: Choose Date
km: សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ

# plsPickDate
source: Please pick a date!!
km: សូមជ្រើសរើសកាលបរិច្ឆេទ !!

# noAttendance
source: NO ATTENDANCE ADDED YET!!
km: មិនទាន់មានវត្តបានបញ្ចូល !!

source: Present
km: វត្តមាន

source: Absent
km: អវត្តមាន

source: Permission
km: សុំច្បាប់

source: Late
km: យឺត

# pickMonth
source: Pick A Month
km: ជ្រើសរើសខែ

source: Enter year
km: បញ្ចូលឆ្នាំ

source: Jan
km: មករា

source: Feb
km: កុម្ភៈ

source: Mar
km: មីនា

source: Apr
km: មេសា

source: May
km: ឧសភា

source: Jun
km: មិថុនា

source: Jul
km: កក្កដា

source: Aug
km: សីហា

source: Sep
km: កញ្ញា

source: Oct
km: តុលា

source: Nov
km: វិច្ឆិកា

source: Dec
km: ធ្នូ

# enter4Digits
source: Please Enter 4 digits
km: សូមបញ្ចូលលេខ ៤ ខ្ទង់

# plsPickMonth
source: Please pick a Month!!
km: សូមជ្រើសរើសខែ

# shortPresent
source: P
km: វ.មាន

# shortPermission
source: PM
km: ច្បាប់

# shortLate
source: L
km: យឺត

# shortAbsent
source: A
km: អ.មាន

# monthYear
source: M/Y
km: ខែ/ឆ្នាំ

source: List
km: តារាង

source: Login
km: ចូល

source: Logging in
km: កំពុងចូល

source: Employee Manager
km: គ្រប់គ្រងបុគ្គលិក

source: Time
km: ពេល

source: Type
km: ប្រភេទ

source: User ID
km: អត្ថលេខបុគ្គលិក

source: checkin
km: ចូល

source: checkout
km: ចេញ

# saveChanges
source: Do you want to save the changes
km: តើអ្នកចង់រក្សាទុកការផ្លាស់ប្តូរមែនទេ?

source: Back
km: ថយក្រោយ

source: Verifying QR code
km: កំពុងបញ្ចាក់QRកូដ

# verifyingQRCodeFailed
source: qr code verification failed.
km: ការបញ្ចាក់QRកូដបានបរាជ័យ។

# adding
source: Adding Data
km: កំពុងបញ្ចូលទិន្នន័យ

source: Success
km: ជោគជ័យ

# newEmpAdded
source: New employee has been added
km: បុគ្គលិកថ្មីត្រូវបានបន្ថែម

source: Done
km: រួចរាល់

# addFail
source: Adding new employee have failed.
km: ការបន្ថែមបុគ្គលិកថ្មីបានបរាជ័យ !

# editing
source: Editing Data
km: កំពុងកែប្រែទិន្នន័យ !

# edited
source: Data has been updated.
km: ទិន្នន័យបានកែប្រែរួចរាល់ !

# editFailed
source: Updating data have failed.
km: ការកែប្រែទិន្នន័យបានបរាជ័យ !

# deleting
source: Deleting employee.
km: កំពុងលុបបុគ្គលិក!

# deleted
source: Employee has been deleted.
km: បុគ្គលិកត្រូវបានលុប!

source: Deleting attendance.
km: កំពុងលុបវត្តមាន!

# deletedAttendance
source: Attendance has been deleted.
km: វត្តមានត្រូវបានលុប!

# personal
source: Personal Info
km: ព័ត៌មានផ្ទាល់ខ្លួន

source: Employment
km: ព័ត៌មានការងារ

source: No Data
km: មិនមានទិន្នន័យ

source: Score
km: ពិន្ទុ

source: Enter Score
km: បញ្ចូលពិន្ទុ

source: Edit Employee
km: កែប្រែព័ត៌មាន

# changesWillLost
source: Your changes will be lost
km: ការផ្លាស់ប្តូររបស់អ្នកនឹងត្រូវបាត់បង់

source: Add Employee
km: បន្ថែមបុគ្គលិក

source: View Attendance
km: មើលវត្តមាន

source: Edit Attendance
km: កែប្រែ វត្តមាន

source: Late. Choose reason:
km: យឺត សូមជ្រើសរើសហេតុផល៖

# lateBlownTire
source: blown tire
km: បែកកង់

# lateTrafficJam
source: traffic jam
km: ស្ទះផ្លូវ

# lateOther
source: other
km: ផ្សេងៗ

source: Start Date
km: ថ្ងៃចាប់ផ្ដើម

source: End Date
km: ថ្ងៃបញ្ចប់

source: Select Start Date
km: ជ្រើសរើសថ្ងៃចាប់ផ្ដើម

source: Select End Date
km: ជ្រើសរើសថ្ងៃបញ្ចប់

# now
source: Present
km: បច្ចុប្បន្ន

# accountName
source: Name
km: ឈ្មោះគណនី

# accountNumber
source: Number
km: លេខគណនី

source: Take Attendance
km: កត់វត្តមាន

source: Scan failed
km: ស្កេនបានបរាជ័យ

source: QR Code
km: QR កូដ
